[
    {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co/bW8T0Yn/img11.png",
        "review": "A gripping psychological thriller with unexpected twists and a shocking conclusion. The Silent Patient by Alex Michaelides takes readers on a suspenseful journey into the mind of Alicia Berenson, a woman accused of murdering her husband. Through the eyes of Theo Faber, a psychotherapist determined to unravel Alicia's silence, the story unfolds with intricate layers of deception and hidden motives. As Theo delves deeper into Alicia's past and psyche, he uncovers dark secrets that challenge his own perceptions of truth and sanity. Michaelides skillfully builds tension with masterful storytelling, keeping readers guessing until the final, jaw-dropping revelation. This novel is a must-read for fans of thrillers and psychological dramas.",
        "totalPages": 336,
        "rating": 4.2,
        "category": "Thriller",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": 2,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "https://i.ibb.co/g9SDj13/img10.png",
        "review": "A powerful memoir depicting resilience, self-discovery, and the pursuit of education against all odds. Educated by Tara Westover is a remarkable account of her journey from growing up in a strict, isolated household in rural Idaho to earning a PhD from Cambridge University. Westover's memoir is a testament to the transformative power of education and the human spirit's capacity for growth and change. With vivid prose and unflinching honesty, she explores the complexities of family loyalty, the impact of trauma, and the quest for identity. Educated is a compelling narrative that inspires readers to reflect on the value of knowledge, the importance of breaking free from limiting beliefs, and the resilience of the human spirit.",
        "totalPages": 334,
        "rating": 4.6,
        "category": "Memoir",
        "tags": ["Biography", "Education"],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 3,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co/tYcNP1C/img3.png",
        "review": "An enchanting and immersive tale of magical rivalry set in a mysterious circus. The Night Circus by Erin Morgenstern transports readers to a world of wonder and enchantment, where a magical competition unfolds under the cover of darkness. As two young illusionists, Celia and Marco, vie for supremacy, their rivalry ignites a series of breathtaking spectacles that captivate audiences and blur the lines between reality and fantasy. Morgenstern's lyrical prose and vivid imagery evoke the allure of the circus, drawing readers into a mesmerizing realm of mystery and romance. The Night Circus is a spellbinding novel that will enchant readers of all ages with its imaginative storytelling and evocative atmosphere.",
        "totalPages": 387,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["Magic", "Romance"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 4,
        "bookName": "The Goldfinch",
        "author": "Donna Tartt",
        "image": "https://i.ibb.co/dpkm4nN/img4.png",
        "review": "A sprawling and emotionally resonant novel exploring grief, art, and the complexities of life. The Goldfinch by Donna Tartt is a sweeping saga that follows the life of Theo Decker, a young man whose world is shattered by tragedy. After surviving a terrorist attack at the Metropolitan Museum of Art, Theo finds himself drawn into a world of crime, art forgery, and moral ambiguity. Tartt's novel is a masterful exploration of grief, guilt, and the search for meaning in a chaotic world. Through Theo's journey, readers are immersed in a richly detailed narrative that spans continents and decades, exploring themes of love, loss, and redemption. The Goldfinch is a profound and deeply moving novel that resonates long after the final page.",
        "totalPages": 784,
        "rating": 4.0,
        "category": "Fiction",
        "tags": ["Art", "Coming-of-age"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2013
    },
    {
        "bookId": 5,
        "bookName": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "https://i.ibb.co/fCdkvD0/img6.png",
        "review": "A mesmerizing blend of mystery, romance, and nature writing set in the marshes of North Carolina. Where the Crawdads Sing by Delia Owens is a captivating tale of survival, love, and the beauty of the natural world. Set against the backdrop of the marshes of North Carolina, the novel follows the life of Kya Clark, a young girl who grows up isolated from society after being abandoned by her family. As Kya navigates the challenges of her solitary existence, she forms deep connections with the wildlife around her and discovers her own strength and resilience. Owens' lyrical prose and vivid descriptions evoke the enchanting landscape of the marsh, immersing readers in a world of beauty and wonder. Where the Crawdads Sing is a poignant and unforgettable story that celebrates the power of nature and the indomitable human spirit.",
        "totalPages": 384,
        "rating": 4.5,
        "category": "Mystery",
        "tags": ["Nature", "Southern Fiction"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 6,
        "bookName": "Vadaima",
        "author": "Yuval Noah Harari",
        "image": "https://i.ibb.co/TWG88p0/img8.png",
        "review": "A thought-provoking exploration of human history and the forces that have shaped our species.",
        "totalPages": 443,
        "rating": 4.7,
        "category": "Nonfiction",
        "tags": ["History", "Anthropology"],
        "publisher": "Harper",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 7,
        "bookName": "Circe",
        "author": "Madeline Miller",
        "image": "https://i.ibb.co/7YpSMWf/img2.png",
        "review": "A captivating retelling of Greek mythology through the perspective of the enchantress Circe.",
        "totalPages": 393,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["Mythology", "Greek"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 8,
        "bookName": "The Subtle Art of Not Giving a F*ck",
        "author": "Mark Manson",
        "image": "https://i.ibb.co/YDGXgYT/img1.png",
        "review": "A refreshing and irreverent take on self-help, offering practical advice for living a meaningful life.",
        "totalPages": 224,
        "rating": 4.0,
        "category": "Self-Help",
        "tags": ["Motivation", "Personal Development"],
        "publisher": "HarperOne",
        "yearOfPublishing": 2016
    },
    {
        "bookId": 9,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/WF5kb2j/img9.png",
        "review": "A timeless tale of self-discovery and following one's dreams, filled with wisdom and inspiration.",
        "totalPages": 197,
        "rating": 4.2,
        "category": "Fiction",
        "tags": ["Philosophical", "Adventure"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 10,
        "bookName": "The Martian",
        "author": "Andy Weir",
        "image": "https://i.ibb.co/dpkm4nN/img4.png",
        "review": "An exhilarating sci-fi adventure that combines humor, suspense, and scientific accuracy.",
        "totalPages": 369,
        "rating": 4.3,
        "category": "Science Fiction",
        "tags": ["Survival", "Space Exploration"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 11,
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "image": "https://i.ibb.co/YDGXgYT/img1.png",
        "review": "A twisted and gripping psychological thriller that keeps readers guessing until the very end.",
        "totalPages": 415,
        "rating": 4.1,
        "category": "Thriller",
        "tags": ["Mystery", "Domestic Fiction"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 12,
        "bookName": "The Handmaid's Tale",
        "author": "Margaret Atwood",
        "image": "https://i.ibb.co/7YpSMWf/img2.png",
        "review": "A chilling dystopian narrative that explores themes of oppression, feminism, and power.",
        "totalPages": 311,
        "rating": 4.3,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Feminism"],
        "publisher": "McClelland & Stewart",
        "yearOfPublishing": 1985
    }
]